app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
  def index
    @chats = Chat.all

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", "messenger"]]
---
  def show
    @chat = Chat.find(params[:id])

INSERT INTO "chats" ("created_at", "from", "message", "updated_at", "where") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 04 Aug 2013 10:36:09 UTC +00:00], ["from", nil], ["message", "2342315"], ["updated_at", Sun, 04 Aug 2013 10:36:09 UTC +00:00], ["where", nil]]
---
  def create
    @chat = Chat.new(params[:chat])

    respond_to do |format|
      if @chat.save

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]
---
  def destroy
    @chat = Chat.find(params[:id])
    @chat.destroy

SELECT "users".* FROM "users" WHERE (session = '0cbdce5559c190151c668c4f65aab222' ) LIMIT 1
---
  def messenger
      @chat = Chat.new
      @name = User.where('session = ? ',session[:session_id]).first

SELECT "chats".* FROM "chats" WHERE (`where` = 'all') ORDER BY "chats"."id" DESC LIMIT 1
---
  def get_message
    # здесь подготовить массив и только потом отправить иначе получится каша
    @messages = Chat.where('`where` = ?': params['where'], 'read = ' :false)

INSERT INTO "chats" ("created_at", "from", "message", "updated_at", "where") VALUES (?, ?, ?, ?, ?)
---
  def save_message
    @chat=Chat.new(:from => session[:session_id], :message => params[:message], :where => 'all', :read => false);
    respond_to do |f|
      if @chat.save